emas/loadtest/emas-performance-report/raw_data/sp4/apache_bench_data/10cus/varnish_ab_test_10_1000000.txt
This is ApacheBench, Version 2.3 <$Revision: 655654 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking qap.everythingscience.co.za (be patient)


Server Software:        Zope/(2.13.15,
Server Hostname:        qap.everythingscience.co.za
Server Port:            80

Document Path:          /portal_css/Sunburst%20Theme/public-cachekey-4fff4ed932d766e26813993d85f43eea.css
Document Length:        31966 bytes

Concurrency Level:      10
Time taken for tests:   2792.971 seconds
Complete requests:      1000000
Failed requests:        0
Write errors:           0
Total transferred:      32552000000 bytes
HTML transferred:       31966000000 bytes
Requests per second:    358.04 [#/sec] (mean)
Time per request:       27.930 [ms] (mean)
Time per request:       2.793 [ms] (mean, across all concurrent requests)
Transfer rate:          11381.81 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    8   2.8      9      14
Processing:    12   20   2.9     19      70
Waiting:        1    9   2.9      9      56
Total:         16   28   3.1     28      80

Percentage of the requests served within a certain time (ms)
  50%     28
  66%     29
  75%     29
  80%     30
  90%     31
  95%     33
  98%     35
  99%     36
 100%     80 (longest request)